WS Project/RCA/src/jbiServiceUnits/RCA.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="RCA"
             xmlns:tns="RCA" xmlns:ns="http://j2ee.netbeans.org/wsdl/CompositeService/CompositeServiceWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/CompositeService/CompositeServiceWSDL" location="../jbiServiceUnits/CompositeService/CompositeServiceWSDL.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:CompositeServiceWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ReservationOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="RCA"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="RCA"/>
            </output>
        </operation>
    </binding>
    <service name="RCAService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/RCAService1/casaPort1"/>
        </port>
    </service>
</definitions>

