WS Project/RCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rca="RCA" xmlns:req="http://xml.netbeans.org/schema/RequestSchema">
  <soapenv:Body>
    <rca:ReservationOperation>
      <reservationInfo>
        <req:flightServiceInformation>
          <req:destination>
            <req:country>?string?</req:country>
            <req:city>?string?</req:city>
          </req:destination>
          <req:tripDate>?string?</req:tripDate>
          <!--Optional:-->
          <req:clientPreferences>
            <!--Optional:-->
            <req:airlines>?string?</req:airlines>
            <!--Optional:-->
            <req:flightType>?string?</req:flightType>
            <!--Optional:-->
            <req:classDegree>?3?</req:classDegree>
          </req:clientPreferences>
          <req:passenger>
            <req:numberOfPassenger>?3?</req:numberOfPassenger>
            <!--1 or more repetitions:-->
            <req:typeOfPassengers>?string?</req:typeOfPassengers>
          </req:passenger>
        </req:flightServiceInformation>
        <req:creditCard>
          <req:person>
            <req:name>
              <req:firstName>?string?</req:firstName>
              <req:middleName>?string?</req:middleName>
              <req:lastName>?string?</req:lastName>
            </req:name>
            <req:phoneNumber>?string?</req:phoneNumber>
            <req:email>?string?</req:email>
            <req:address>?string?</req:address>
          </req:person>
          <req:creditCardInfo>
            <req:PIN>?string?</req:PIN>
            <req:balance>?1.051732E7?</req:balance>
            <req:expiredDate>?string?</req:expiredDate>
          </req:creditCardInfo>
        </req:creditCard>
        <req:rental>
          <req:vehicle>
            <req:brand>?string?</req:brand>
            <req:color>?string?</req:color>
          </req:vehicle>
          <req:rate>
            <req:type>?string?</req:type>
            <req:codes>?string?</req:codes>
            <req:rateValue>?1.051732E7?</req:rateValue>
            <!--Optional:-->
            <req:promotionalCodes>?string?</req:promotionalCodes>
            <req:rank>
              <req:leisure>?string?</req:leisure>
              <req:corporate>?string?</req:corporate>
            </req:rank>
            <req:distance>
              <req:limited>?string?</req:limited>
              <req:unlimited>?string?</req:unlimited>
            </req:distance>
          </req:rate>
          <req:rentalPeriod>?1.051732E7?</req:rentalPeriod>
          <req:PIN>?string?</req:PIN>
        </req:rental>
        <req:hotelReservationApplication>
          <!--1 or more repetitions:-->
          <req:date>?string?</req:date>
          <req:dateRange>?string?</req:dateRange>
          <req:priceRange>?string?</req:priceRange>
          <req:price>?1.051732E7?</req:price>
          <!--1 or more repetitions:-->
          <req:roomTypes>?string?</req:roomTypes>
          <req:roomRate>
            <req:regular>?string?</req:regular>
            <req:highClass>?string?</req:highClass>
            <req:anyone>?string?</req:anyone>
          </req:roomRate>
          <!--Zero or more repetitions:-->
          <req:services>?string?</req:services>
          <!--Zero or more repetitions:-->
          <req:amenities>?string?</req:amenities>
          <req:PIN>?string?</req:PIN>
        </req:hotelReservationApplication>
      </reservationInfo>
    </rca:ReservationOperation>
  </soapenv:Body>
</soapenv:Envelope>